frappe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-10 Thu 12:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>frappe framework tips and tricks</title>
<meta name="author" content="Ahmed Abdulrahman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">frappe framework tips and tricks</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2d9e51c">1. Table of Contents</a>
<ul>
<li><a href="#orge8fbd08">1.1. Python</a></li>
<li><a href="#org123f00d">1.2. Js</a>
<ul>
<li><a href="#orgf65f194">1.2.1. Change property of child table</a></li>
</ul>
</li>
<li><a href="#org2884199">1.3. Commands</a>
<ul>
<li><a href="#org615b705">1.3.1. Reset admin password</a></li>
<li><a href="#org4f624a0">1.3.2. Download custom frappe version</a></li>
<li><a href="#org89f37a0">1.3.3. Get app from specific branch</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
this is a list of lessons that i learned during working as frappe developer.<br />
</p>

<div id="outline-container-org2d9e51c" class="outline-2">
<h2 id="org2d9e51c"><span class="section-number-2">1.</span> Table of Contents</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<ul class="org-ul">
<li><br /></li>
<li><br />
<ul class="org-ul">
<li><br /></li>
</ul></li>
<li><br />
<ul class="org-ul">
<li><br /></li>
<li><br /></li>
<li><br /></li>
</ul></li>
</ul>
</blockquote>
</div>

<div id="outline-container-orge8fbd08" class="outline-3">
<h3 id="orge8fbd08"><span class="section-number-3">1.1.</span> Python</h3>
</div>
<div id="outline-container-org123f00d" class="outline-3">
<h3 id="org123f00d"><span class="section-number-3">1.2.</span> Js</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf65f194" class="outline-4">
<h4 id="orgf65f194"><span class="section-number-4">1.2.1.</span> Change property of child table</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
changing the property of a field in child table such as making it <b>hidden</b> or <b>readonly</b>.<br />
</p>

<p>
we have two methods here:<br />
</p>

<ul class="org-ul">
<li><p>
using <b>set<sub>df</sub><sub>property</sub></b> <span class="underline">prefered</span> :<br />
<code>set_df_property(fieldname, property, value, docname, table_field, table_row_name=null)</code><br />
fieldname =&gt; child table <span class="underline">fieldname</span> ex: <b>product<sub>order</sub><sub>details</sub></b>.<br />
property =&gt; property which you want to change ex: <b>read<sub>only</sub></b>.<br />
value =&gt; property value.<br />
docname =&gt; frm name.<br />
table<sub>field</sub> =&gt; child table field name.<br />
table<sub>row</sub><sub>name</sub> =&gt; row name value <b>'6bsl2342'</b> for example.<br />
</p>

<p>
example:<br />
</p>
<div class="org-src-container">
<pre class="src src-js">frm.set_df_property(<span style="color: #8b2252;">'payment'</span>, <span style="color: #8b2252;">'read_only'</span>, 1, frm.doc.name, <span style="color: #8b2252;">'payment_amount'</span>, frm.selected_doc.name)
</pre>
</div></li>

<li><p>
using <b>meta</b>:<br />
in the following example i change the measure button to hidden when it clicked.<br />
</p>
<div class="org-src-container">
<pre class="src src-js">frappe.ui.form.on(<span style="color: #8b2252;">"Product Order Details"</span>, {
    <span style="color: #0000ff;">measure</span>: <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">frm</span>, <span style="color: #a0522d;">cdt</span>, <span style="color: #a0522d;">cdn</span>) {
        <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">df_measure</span>  = frappe.meta.get_docfield(<span style="color: #8b2252;">'Product Order Details'</span>, <span style="color: #8b2252;">'measure'</span>, cdn);
        df_measure.hidden = 1;
    }
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2884199" class="outline-3">
<h3 id="org2884199"><span class="section-number-3">1.3.</span> Commands</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org615b705" class="outline-4">
<h4 id="org615b705"><span class="section-number-4">1.3.1.</span> Reset admin password</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-shell">bench --site alquds set-admin-password admin 
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f624a0" class="outline-4">
<h4 id="org4f624a0"><span class="section-number-4">1.3.2.</span> Download custom frappe version</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
by default frappe download <b>develop</b> version so it's better to select specific version.<br />
</p>

<div class="org-src-container">
<pre class="src src-shell">bench init frappe-14 --version=version-14
</pre>
</div>
</div>
</div>


<div id="outline-container-org89f37a0" class="outline-4">
<h4 id="org89f37a0"><span class="section-number-4">1.3.3.</span> Get app from specific branch</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">
<pre class="src src-shell">bench get-app erpnext --branch version-14
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ahmed Abdulrahman</p>
<p class="date">Created: 2023-08-10 Thu 12:15</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
